// Дана вот такая структура для хранения списка дел за определенные даты:
// let affairs = {
// 	'2019-12-28': ['дело11', 'дело12', 'дело13'],
// 	'2019-12-39': ['дело21', 'дело22', 'дело23'],
// 	'2019-12-30': ['дело31', 'дело32', 'дело33'],
// }
// Сделайте функцию addAffair, которая будет добавлять новое дело в заданную дату. Пусть функция первым параметром принимает дату, а вторым - дело.

let affairs = {
	'2019-12-28': ['дело11', 'дело12', 'дело13'],
	'2019-12-29': ['дело21', 'дело22', 'дело23'],
	'2019-12-30': ['дело31', 'дело32', 'дело33'],
}

function addAffair(date, af){
  if(affairs[date] === undefined){
    affairs[date] = [];
  }

  affairs[date].push(af);
}

addAffair('2019-12-28', 'дело14');
addAffair('2019-12-31', 'дедл41');

console.log(affairs);
