// Дана вот такая структура для хранения списка дел за определенные даты:
//
// let affairs = {
// 	'2019-12-28': ['дело11', 'дело12', 'дело13'],
// 	'2019-12-29': ['дело21', 'дело22', 'дело23'],
// 	'2019-12-30': ['дело31', 'дело32', 'дело33'],
// }
// Добавьте еще одно дело в дату '2019-12-29'. Добавьте еще два дела в дату '2019-12-31'.

let affairs = {
	'2019-12-28': ['дело11', 'дело12', 'дело13'],
	'2019-12-29': ['дело21', 'дело22', 'дело23'],
	'2019-12-30': ['дело31', 'дело32', 'дело33'],
}

affairs['2019-12-29'].push('дело24');

affairs['2019-12-31'] = [];
affairs['2019-12-31'].push('дело41');
affairs['2019-12-31'].push('дело42');

console.log(affairs);
