// Дан такой объект:
// let data = {
// 	2018: {
// 		11: {
// 			29: [1, 2, 3],
// 			30: [4, 5],
// 		},
// 		12: {
// 			30: [6, 7],
// 			31: [8, 9],
// 		},
// 	},
// 	2019: {
// 		12: {
// 			29: [10, 11],
// 			30: [12, 13],
// 			31: [14, 15],
// 		}
// 	},
// }
// Запишите все элементы этого объекта в какой-нибудь массив, вот так:
// [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

let result = [];
let data = {
	2018: {
		11: {
			29: [1, 2, 3],
			30: [4, 5],
		},
		12: {
			30: [6, 7],
			31: [8, 9],
		},
	},
	2019: {
		12: {
			29: [10, 11],
			30: [12, 13],
			31: [14, 15],
		}
	},
}

for(let key in data){
  for(let key2 in data[key]){
    for(let key3 in data[key][key2]){
      for(let elem of data[key][key2][key3]){
        result.push(elem);
      }
    }
  }
}

console.log(result);
