// Дан такой список дел за определенную дату:
// let affairs = {
// 	'2019-12-31': ['массив дел'],
// 	'2018-11-29': ['массив дел'],
// 	'2018-11-30': ['массив дел'],
// 	'2018-12-27': ['массив дел'],
// 	'2019-12-29': ['массив дел'],
// 	'2019-12-30': ['массив дел'],
// 	'2018-12-30': ['массив дел'],
// 	'2018-12-31': ['массив дел'],
// }
// Выведите на экран все дела за 2018 год.
// Выведите на экран все дела за 12 месяц 2018 года.

let affairs = {
	'2019-12-31': ['массив дел'],
	'2018-11-29': ['массив дел'],
	'2018-11-30': ['массив дел'],
	'2018-12-27': ['массив дел'],
	'2019-12-29': ['массив дел'],
	'2019-12-30': ['массив дел'],
	'2018-12-30': ['массив дел'],
	'2018-12-31': ['массив дел'],
}

for(let key in affairs){
  let strDate = key;
  let result = strDate.split('-');
  if(result[0] === '2018'){
    console.log(key + ' ' + affairs[key]);
  }
}
